"""
Твърди се, че Юлий Цезар е криптирал секретни съобщения, като е премиествал всяка буква с определен брой позиции.
Нека наречем съобщението просто текст, криптираното съобщение - шифър, а отместването ключ.

Напр.:

    текст: hello
    ключ: 1
    шъфър: ifmmp

Напишете двойката функции `encrypt` и `decrypt`.
"""

def encrypt(text, key):
    """
    Връщат текста шифрован (буквите са изместени с `key` позиции)
    """
    pass


def decrypt(cipher, key):
    """
    Връщат оригиналиня текст
    """
    pass
