"""
Твърди се, че Юлий Цезар е криптирал секретни съобщения, като е премиествал всяка буква с определен брой позиции.
Нека наречем съобщението просто текст, криптираното съобщение - шифър, а отместването ключ.

Пирмер:

    текст: hello
    ключ: 1
    шифър: ifmmp

Напишете двойката функции `encrypt` и `decrypt`.
"""

def encrypt(text, key):
    """
    Връща текста шифрован (буквите са изместени с `key` позиции)
    """
    pass


def decrypt(cipher, key):
    """
    Връща оригиналиня текст
    """
    pass
