from game import can_move, play

def move_player(player):
    """
    Целта е да преместите играча една позиция надясно.
    Но не винаги това е възможнот.
    Използвайте функцията `can_move` за да проверите това.
    `can_move` приема координати `x` и `y` на новата позиция на която искате
    да преместите играча и връща резултат `True` ако това е възможно.

    Пример - опит за преместване на дясно:
    ```
        if can_move(x + 1, y):
            player.goto(x + 1, y)
    ```
    """

    # координати на играча
    x = player.xcor()
    y = player.ycor()

    # Добавете вашия код тук


play(move_player)
