"""
Ресто

Разполагате с неограничен брой банкноти от 1, 2 и 5 лева.
Напишете функция `split_change`, която:

* приема парична сума `change`
* извежда сумата като сбор от банкноти по 1, 2 и 5 лева.
Банкнотите трябва да бъдат минимален брой.
* Изписва на отделни редове брой банкноти и вид във формат (брой * вид)
* Приемете, че въведената сума може да се представи с наличните банкноти

Пример:

>>> split_change(7)
1 * 5
1 * 2

>>> split_change(8)
1 * 5
1 * 2
1 * 1

>>> split_change(11)
2 * 5
1 * 1
"""

def split_change(change):
    pass
